CSI API ETABS v1

# cSapModelDesignResults Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignResults DesignResults { get; }

    ReadOnly Property DesignResults As cDesignResults
    	Get

    Dim instance As cSapModel
    Dim value As cDesignResults

    value = instance.DesignResults

    property cDesignResults^ DesignResults {
    	cDesignResults^ get ();
    }

    abstract DesignResults : cDesignResults with get

#### Property Value

Type: cDesignResults

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com